/*Виклик в контексті масиву
важливість: 5
Яким буде результат? Чому?

let arr = ["a", "b"];

arr.push(function() {
  alert( this );
});

arr[2](); // ?*/

/* - - - Моя відповідь - - -*/
let arr = ["a", "b"];

arr.push(function() {
  console.log( this );
});

console.log (arr[2]());
/*До масиву запушили функцію, але вона тут викликається як метод 
масиву arr, тому при спробі вивести масив нам покажеться вміст масиву
разом із доданою функцією. ( (This) всередині функції вказує на 
сам масив arr) */

