/*Сума введених чисел
важливість: 4
Напишіть функцію sumInput() яка:

Просить користувача ввести дані за допомогою prompt та зберігає їх в масив.
Закінчує робити запити в користувача після того, як введено не числове значення, порожня строка або натиснуто “відмінити”.
Підраховує та повертає суму елементів масиву.
P.S. Нуль 0 це – валідне число, будь ласка, не зупиняйте функцію при введені 0.*/

/* - - - Моя відповідь - - -*/
function sumInput () {
    let numbers = []
    while (true) {
        let value = prompt ('Введіть число', 0);
            if (value === '' || value === null || !isFinite(value)) break;
        numbers.push(+value);
    }
    let sum = 0;
    for (let number of numbers) {
        sum += number;
    }
    return sum;
}

alert (`Я тут порахував і ось що вийшло: ${sumInput ()}`);