/*Повторюйте, поки вхід не буде числом (Задача)
важливість: 5
Створіть функцію readNumber, яка запросить число, поки відвідувач не 
введе дійсне числове значення.

Отримане значення потрібно повернути як число.

Відвідувач також може зупинити процес, ввівши порожній рядок або натиснувши 
“CANCEL”. У цьому випадку функція повинна повернути null.*/

/* - - - Моя відповідь - - -*/

function readNumber () {
    let number;
    do {
        number = prompt('Введіть число', 0);
    } while (!isFinite(number));
    if (number === null || number === '') return null;
    return +number;
}

alert (`Ваше число: ${readNumber()}!`);